export class SelfCheck {
  static mySelfCheck() :void {
    console.log('Привет, проверяющий! :) тут немножко текста');
    console.log('САМООЦЕНКА');
    console.log('- Страница с игрушками +10');
    console.log('- Карточка игрушки +10');
    console.log('- Добавление игрушек в избранное (кликаем по снежинке) +20');
    console.log('- Сортировка +20');
    console.log('- Фильтры в указанном диапазоне от и до +30');
    console.log('- Фильтры по значению +30');
    console.log('- Можно отфильтровать игрушки по нескольким фильтрам разного типа +20');
    console.log('- Сброс фильтров +20');
    console.log('- Сохранение настроек в local storage +10');
    console.log('- Cброса настроек очищает локал сторедж (проверить в Application) и отражает первоначальный вид');
    console.log('- Поиск +30');
    console.log('- если очистить с помощью крестика, надо нажать enter');
    console.log('ИТОГО: 200');
  }
}
